package com.test.project.ui.schedule

import androidx.lifecycle.ViewModel
import com.test.project.domain.entity.Lesson

class ScheduleViewModel : ViewModel() {
    val tabTitles = arrayOf(
        "ПН", "ВТ", "СР", "ЧТ", "ПТ", "СБ"
    )
    val scheduleArray = listOf(
        listOf(
            Lesson(
                3,
                "АиВМО", "Галкина М.Ю.", "Лекция", "Дистанционно"
            ),
            Lesson(
                4,
                "ПГП", "Малков Е.А.", "Лекция", "Дистанционно"
            ),
            Lesson(
                5,
                "АиВМО", "Галкина М.Ю.", "Практика", "Дистанционно"
            ),
        ),
        listOf(),
        listOf(
            Lesson(
                2,
                "Сетевое программирование|Безопасность жизнедеятельности",
                "Павский К.В. | Абрамова Е.С.",
                "Лекция",
                "Дистанционно"
            ),
            Lesson(
                3,
                "ПМУ", "Нечта И.В.", "Лекция", "Дистанционно"
            ),
            Lesson(
                4,
                "Менеджмент|--",
                "Сафонова Л.А.",
                "Лекция",
                "Дистанционно"
            ),
            Lesson(
                5,
                "Менеджмент|--",
                "Сафонова Л.А.",
                "Практика",
                "Дистанционно"
            ),
        ),
        listOf(
            Lesson(
                1,
                "Безопасность жизнедеятельности",
                "Абрамова Е.С.",
                "Практика",
                "412(К.1)"
            ),
            Lesson(
                2,
                "ПГП", "Нужнов А.В.", "Практика", "432(К.1)"
            ),
            Lesson(
                3,
                "Сетевое программирование",
                "Павский К.В.",
                "Практика",
                "408(К.1)"
            ),
            Lesson(
                4,
                "ПМУ", "Павлова У.В.", "Практика", "420(К.5)"
            )
        ),
        listOf(
            Lesson(1, "Военная подготовка", "", "", "(К.4)")
        ),
        listOf()
    )
}